content/it/docs/80 Progetti/ProgettoMipaf/Esempi di XML per la modalita_web-service/Produzione burro/Asincroni/CancSoggSiRPBu.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://cooperazione.sian.it/schema/SoapAutenticazione" xmlns:wsm="http://cooperazione.sian.it/schema/wsmrge/">
   <soapenv:Header>
      <soap:SOAPAutenticazione>
         <!--Credenziali rilasciate dal Ministero all'azienda-->
         <username>AAAAAAAAAA</username>
         <password>BBBBBBBBBB</password>
         <nomeServizio>CancSoggSiRPBu</nomeServizio>
      </soap:SOAPAutenticazione>
   </soapenv:Header>
   <soapenv:Body>
      <wsm:CancSoggSiRPBuInput>
         <wsm:CodOper>
            <!--Indicazione del Codice Fiscale dell'azienda (valorizzare tag persona fisica o giuridica)-->
            <wsm:PersonaGiuridica>01234567890</wsm:PersonaGiuridica>
         </wsm:CodOper>
         <!--Codice ICQRF dello stabilimento nel formato AANNNN-->
         <wsm:CodiceIcqrf>RM1234</wsm:CodiceIcqrf>
         <!--Specificare una o più soggetti da cancellare-->
         <wsm:SoggettoElimina>
            <!--Codice alfanumerico del soggetto presente in ANAGRAFICA-->
            <wsm:CodiceSoggetto>BB1824</wsm:CodiceSoggetto>
         </wsm:SoggettoElimina>
         <wsm:SoggettoElimina>
            <!--Codice alfanumerico del soggetto presente in ANAGRAFICA-->
            <wsm:CodiceSoggetto>3234</wsm:CodiceSoggetto>
         </wsm:SoggettoElimina>
      </wsm:CancSoggSiRPBuInput>
   </soapenv:Body>
</soapenv:Envelope>